driver-tests/bpelse/assign/AssignBpel/src/Assign/echoSubstringBefore.wsdl

<?xml version="1.0" encoding="UTF-8"?><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://stc.com/echoSubstringBefore" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="echoSubstringBefore" targetNamespace="http://stc.com/echoSubstringBefore">
    <types>
        <xsd:schema elementFormDefault="qualified" targetNamespace="http://stc.com/echoSubstringBefore">
            <xsd:element name="item">
                <xsd:complexType>
                    <xsd:sequence>
                        <xsd:element name="value" type="xsd:string"/>
                    </xsd:sequence>
                </xsd:complexType>
            </xsd:element>
        </xsd:schema>
    </types>
    <message name="echoSubstringBefore">
        <part element="tns:item" name="part"/>
    </message>
    <portType name="echoSubstringBefore">
        <operation name="echoSubstringBefore">
            <input message="tns:echoSubstringBefore"/>
            <output message="tns:echoSubstringBefore"/>
        </operation>
    </portType>
    <binding name="Binding" type="tns:echoSubstringBefore">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="echoSubstringBefore">
            <soap:operation soapAction="echoSubstringBefore"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="echoSubstringBeforeService">
        <port binding="tns:Binding" name="port">
            <soap:address location="http://localhost:${HttpDefaultPort}/echoSubstringBefore"/>
        </port>
    </service>
    <plnk:partnerLinkType xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" name="SLT">
        <plnk:role name="server" portType="tns:echoSubstringBefore"/>
    </plnk:partnerLinkType>
</definitions>
