driver-tests/bpelse/i18n/assign/AssignJbi/test/echoSubstringBeforeInvoke/Input.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echoSubstringBefore/"
                   xmlns="http://stc.com/echoSubstringBefore">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
  <item>
    <value>Helloあいうえお あいうえおWorld</value>
  </item>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>